# language: ru
Функция: Работа с очередью сообщений

  Сценарий: Проверка пустой очереди
    Дана пустая очередь
    Тогда очередь должна быть пустой
    И при попытке извлечь сообщение возникает ошибка

  Сценарий: Добавление сообщений
    Дана пустая очередь
    Когда я добавляю сообщение "Первое"
    Тогда очередь не должна быть пустой
    И следующим сообщением будет "Первое"

  Сценарий: Порядок FIFO
    Дана очередь с сообщениями "Один", "Два", "Три"
    Когда я извлекаю сообщение
    Тогда извлеченным сообщением будет "Один"
    И первым в очереди останется "Два"
